#ifndef __RNG_H
#define __RNG_H
#include "sys.h"


//////////////////////////////////////////////////////////////////////////////////	 
/**************************************************************************************/
//RNG(随机数发生器)驱动代码	 
//STM32H7工程模板-HAL库函数版本
//DevEBox  大越创新
//嵌入式开发网
//淘宝店铺：mcudev.taobao.com
//淘宝店铺：shop389957290.taobao.com	

/**************************************************************************************/							  
////////////////////////////////////////////////////////////////////////////////// 	

u8  RNG_Init(void);			//RNG初始化 
u32 RNG_Get_RandomNum(void);//得到随机数
int RNG_Get_RandomRange(int min,int max);//生成[min,max]范围的随机数




#endif









































/**************************************************************************************/

//STM32H7工程模板-HAL库函数版本
//DevEBox  大越创新
//嵌入式开发网
//淘宝店铺：mcudev.taobao.com
//淘宝店铺：shop389957290.taobao.com	

/**************************************************************************************/











